app/controllers/fortunes_controller.rb

SELECT `fortunes`.* FROM `fortunes` ORDER BY RANDOM() LIMIT 1
---
  def result
    @fortune = Fortune.order("RAND()").first